[
  {
    "name": "Penicillin G",
    "cid": 5904,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/5904",
    "mechanism": "By binding to specific penicillin-binding proteins (PBPs) located inside the bacterial cell wall, penicillin G inhibits the third and last stage of bacterial cell wall synthesis. Cell lysis is then mediated by bacterial cell wall autolytic enzymes such as autolysins; it is possible that penicillin G interferes with an autolysin inhibitor.",
    "pharmacology": "Penicillin G is a penicillin beta-lactam antibiotic used in the treatment of bacterial infections caused by susceptible, usually gram-positive, organisms. The name \"penicillin\" can either refer to several variants of penicillin available, or to the group of antibiotics derived from the penicillins. Penicillin G has <i>in vitro</i> activity against gram-positive and gram-negative aerobic and anaerobic bacteria. The bactericidal activity of penicillin G results from the inhibition of cell wall synthesis and is mediated through penicillin G binding to penicillin binding proteins (PBPs). Penicillin G is stable against hydrolysis by a variety of beta-lactamases, including penicillinases, and cephalosporinases and extended spectrum beta-lactamases.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Penicillins",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=5904&t=l",
    "molecular_formula": "C16H18N2O4S",
    "molecular_weight": "334.4",
    "smiles": "CC1([C@@H](N2[C@H](S1)[C@@H](C2=O)NC(=O)CC3=CC=CC=C3)C(=O)O)C",
    "inchi_key": "JGSARLDLIJGVTE-MBNYWOFBSA-N"
  },
  {
    "name": "Amoxicillin",
    "cid": 33613,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/33613",
    "mechanism": "Amoxicillin competitively inhibits penicillin-binding protein 1 and other high molecular weight penicillin binding proteins.  Penicillin bind proteins are responsible for glycosyltransferase and transpeptidase reactions that lead to cross-linking of D-alanine and D-aspartic acid in bacterial cell walls. Without the action of penicillin binding proteins, bacteria upregulate autolytic enzymes and are unable to build and repair the cell wall, leading to bacteriocidal action.",
    "pharmacology": "Amoxicillin competitively inhibit penicillin binding proteins, leading to upregulation of autolytic enzymes and inhibition of cell wall synthesis. Amoxicillin has a long duration of action as it is usually given twice daily. Amoxicillin has a wide therapeutic range as mild overdoses are not associated with significant toxicity. Patients should be counselled regarding the risk of anaphylaxis, _Clostridium difficile_ infections, and bacterial resistance.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-infective Agents; Antibacterial Agents; Penicillins",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=33613&t=l",
    "molecular_formula": "C16H19N3O5S",
    "molecular_weight": "365.4",
    "smiles": "CC1([C@@H](N2[C@H](S1)[C@@H](C2=O)NC(=O)[C@@H](C3=CC=C(C=C3)O)N)C(=O)O)C",
    "inchi_key": "LSQZJLSUYDQPKJ-NJBDSQKTSA-N"
  },
  {
    "name": "Ciprofloxacin",
    "cid": 2764,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/2764",
    "mechanism": "Ciprofloxacin acts on bacterial topoisomerase II (DNA gyrase) and topoisomerase IV. Ciprofloxacin's targeting of the alpha subunits of DNA gyrase prevents it from supercoiling the bacterial DNA which prevents DNA replication.",
    "pharmacology": "Ciprofloxacin is a second generation fluoroquinolone that is active against many Gram negative and Gram positive bacteria. It produces its action through inhibition of bacterial DNA gyrase and topoisomerase IV. Ciprofloxacin binds to bacterial DNA gyrase with 100 times the affinity of mammalian DNA gyrase. There is no cross resistance between fluoroquinolones and other classes of antibiotics, so it may be of clinical value when other antibiotics are no longer effective. Ciprofloxain and its derivatives are also being investigated for its action against malaria, cancers, and AIDS.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Quinolones; Fluoroquinolones",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=2764&t=l",
    "molecular_formula": "C17H18FN3O3",
    "molecular_weight": "331.34",
    "smiles": "C1CC1N2C=C(C(=O)C3=CC(=C(C=C32)N4CCNCC4)F)C(=O)O",
    "inchi_key": "MYSWGUAQZAJSOK-UHFFFAOYSA-N"
  },
  {
    "name": "Tetracycline",
    "cid": 54675776,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/54675776",
    "mechanism": "Tetracycline passively diffuses through porin channels in the bacterial membrane and reversibly binds to the 30S ribosomal subunit, preventing binding of tRNA to the mRNA-ribosome complex, and thus interfering with protein synthesis.",
    "pharmacology": "Tetracycline is a short-acting antibiotic that  inhibits bacterial growth by inhibiting translation. It binds to the 30S ribosomal subunit and prevents the amino-acyl tRNA from binding to the A site of the ribosome. It also binds to some extent to the 50S ribosomal subunit. This binding is reversible in nature. Additionally tetracycline may alter the cytoplasmic membrane of bacteria causing leakage of intracellular contents, such as nucleotides, from the cell.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Tetracyclines",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=54675776&t=l",
    "molecular_formula": "C22H24N2O8",
    "molecular_weight": "444.4",
    "smiles": "C[C@@]1([C@H]2C[C@H]3[C@@H](C(=O)C(=C([C@]3(C(=O)C2=C(C4=C1C=CC=C4O)O)O)O)C(=O)N)N(C)C)O",
    "inchi_key": "NWXMGUDVXFXRIG-WESIUVDSSA-N"
  },
  {
    "name": "Vancomycin",
    "cid": 14969,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/14969",
    "mechanism": "The bactericidal action of vancomycin results primarily from inhibition of cell-wall biosynthesis. Specifically, vancomycin prevents incorporation of N-acetylmuramic acid (NAM)- and N-acetylglucosamine (NAG)-peptide subunits from being incorporated into the peptidoglycan matrix, which forms the major structural component of Gram-positive cell walls. Vancomycin forms hydrogen bonds with the terminal D-alanyl-D-alanine moieties of the NAM/NAG-peptides, preventing the incorporation of the NAM/NAG-peptide subunits into the peptidoglycan matrix. In addition, vancomycin alters bacterial-cell-membrane permeability and RNA synthesis. There is no cross-resistance between vancomycin and other antibiotics. Vancomycin is not active in vitro against gram-negative bacilli, mycobacteria, or fungi.",
    "pharmacology": "Vancomycin is a branched tricyclic glycosylated nonribosomal peptide often reserved as the \"drug of last resort\", used only after treatment with other antibiotics has failed. Vancomycin has been shown to be active against most strains of the following microorganisms, both in vitro and in clinical infections: <i>Listeria monocytogenes</i>, <i>Streptococcus pyogenes</i>, <i>Streptococcus pneumoniae</i> (including penicillin-resistant strains), <i>Streptococcus agalactiae</i>, <i>Actinomyces</i> species, and <i>Lactobacillus</i> species. The combination of vancomycin and an aminoglycoside acts synergistically in vitro against many strains of Staphylococcus aureus, Streptococcus bovis, enterococci, and the viridans group streptococci.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Glycopeptides",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=14969&t=l",
    "molecular_formula": "C66H75Cl2N9O24",
    "molecular_weight": "1449.2",
    "smiles": "C[C@H]1[C@H]([C@@](C[C@@H](O1)O[C@@H]2[C@H]([C@@H]([C@H](O[C@H]2OC3=C4C=C5C=C3OC6=C(C=C(C=C6)[C@H]([C@H](C(=O)N[C@H](C(=O)N[C@H]5C(=O)N[C@@H]7C8=CC(=C(C=C8)O)C9=C(C=C(C=C9O)O)[C@H](NC(=O)[C@H]([C@@H](C1=CC(=C(O4)C=C1)Cl)O)NC7=O)C(=O)O)CC(=O)N)NC(=O)[C@@H](CC(C)C)NC)O)Cl)CO)O)O)(C)N)O",
    "inchi_key": "MYPYJXKWCTUITO-LYRMYLQWSA-N"
  },
  {
    "name": "Erythromycin",
    "cid": 12560,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/12560",
    "mechanism": "In order to replicate, bacteria require a specific process of protein synthesis, enabled by ribosomal proteins. Erythromycin acts by inhibition of protein synthesis by binding to the 23S ribosomal RNA molecule in the 50S subunit of ribosomes in susceptible bacterial organisms.  It stops bacterial protein synthesis by inhibiting the transpeptidation/translocation step of protein synthesis and by inhibiting the assembly of the 50S ribosomal subunit. This results in the control of various bacterial infections. The strong affinity of macrolides, including erythromycin, for bacterial ribosomes, supports their broad‐spectrum antibacterial activities.",
    "pharmacology": "Macrolides, such as erythromycin, stop bacterial growth by inhibiting protein synthesis and translation, treating bacterial infections. Erythromycin does not exert effects on nucleic acid synthesis. This drug has been shown to be active against most strains of the following microorganisms, effectively treating both in vitro and clinical infections. Despite this, it is important to perform bacterial susceptibility testing before administering this antibiotic, as resistance is a common issue that may affect treatment.   **A note on antimicrobial resistance, pseudomembranous colitis, and hepatotoxicity**  Many strains of Haemophilus influenzae are resistant to erythromycin alone but are found to be susceptible to erythromycin and sulfonamides used in combination. It is important to note that Staphylococci that are resistant to erythromycin may emerge during erythromycin and/or sulfonamide therapy. Pseudomembranous colitis has been reported with most antibacterial agents, including erythromycin, and may range in severity from mild to life-threatening. Therefore, the physician should consider this diagnosis in patients with diarrhea after the administration of antibacterial agents. Erythromycin can cause hepatic dysfunction, cholestatic jaundice, and abnormal liver transaminases, particularly when erythromycin estolate is administered.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Dermatologic Agents; Macrolides",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=12560&t=l",
    "molecular_formula": "C37H67NO13",
    "molecular_weight": "733.9",
    "smiles": "CC[C@@H]1[C@@]([C@@H]([C@H](C(=O)[C@@H](C[C@@]([C@@H]([C@H]([C@@H]([C@H](C(=O)O1)C)O[C@H]2C[C@@]([C@H]([C@@H](O2)C)O)(C)OC)C)O[C@H]3[C@@H]([C@H](C[C@H](O3)C)N(C)C)O)(C)O)C)C)O)(C)O",
    "inchi_key": "ULGZDMOVFRHVEP-RWJQBGPGSA-N"
  },
  {
    "name": "Doxycycline",
    "cid": 54671203,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/54671203",
    "mechanism": "Protein synthesis is essential for survival and functioning of cells, including bacteria. Doxycycline inhibits bacterial protein synthesis by allosterically binding to the 30S prokaryotic ribosomal subunit. The drug blocks the association charged aminoacyl-tRNA (aa-tRNA) with the ribosomal A site, which is the acceptor site on the mRNA-ribosome complex. Doxycycline ultimately impedes the elongation phase of protein synthesis and halts the production of essential proteins for bacterial survival and functioning.  Doxycycline mediates anti-inflammatory actions by preventing calcium-dependent microtubular assembly and lymphocytic proliferation, thereby inhibiting leukocyte movement during inflammation. It also inhibits nitric oxide synthase, which is an enzyme that produces nitric oxide, an inflammatory signaling molecule.",
    "pharmacology": "Doxycycline and other tetracyclines are mainly bacteriostatic and are thought to exert antimicrobial effects by the inhibition of protein synthesis. They suppress the growth of bacteria or keep them in the stationary phase of growth. Tetracyclines have antimicrobial spectrum of activity against a variety of gram-positive and gram-negative microorganisms. Cross-resistance of these microorganisms to tetracyclines is a common occurrence.   As it is a highly lipophilic drug, doxycycline crosses multiple membranes of target molecules. Doxycycline shows favorable intra-cellular penetration, with bacteriostatic activity against a wide range of bacteria. Doxycycline also exhibits antiparasitic properties and anti-inflammatory actions. Its anti-inflammatory effects were investigated in various inflammatory skin conditions, such as bullous dermatoses and rosacea.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Tetracyclines",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=54671203&t=l",
    "molecular_formula": "C22H24N2O8",
    "molecular_weight": "444.4",
    "smiles": "C[C@@H]1[C@H]2[C@@H]([C@H]3[C@@H](C(=O)C(=C([C@]3(C(=O)C2=C(C4=C1C=CC=C4O)O)O)O)C(=O)N)N(C)C)O",
    "inchi_key": "SGKRLCUYIXIAHR-AKNGSSGZSA-N"
  },
  {
    "name": "Clindamycin",
    "cid": 446598,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/446598",
    "mechanism": "Clindamycin inhibits bacterial protein synthesis by binding to 23S RNA of the 50S subunit of the bacterial ribosome. It impedes both the assembly of the ribosome and the translation process. The molecular mechanism through which this occurs is thought to be due to clindamycin's three-dimensional structure, which closely resembles the 3'-ends of L-Pro-Met-tRNA and deacylated-tRNA during the peptide elongation cycle - in acting as a structural analog of these tRNA molecules, clindamycin impairs peptide chain initiation and may stimulate dissociation of peptidyl-tRNA from bacterial ribosomes.  The mechanism through which topical clindamycin treats acne vulgaris is unclear, but may be related to its activity against _Propionibacterium acnes_, a bacteria that has been associated with acne.",
    "pharmacology": "Clindamycin exerts its bacteriostatic effect via inhibition of microbial protein synthesis. Clindamycin has a relatively short T<sub>max</sub> and half-life necessitating administration every six hours to ensure adequate antibiotic concentrations.   _Clostridium difficile_ associated diarrhea (CDAD) has been observed in patients using clindamycin, ranging in severity from mild diarrhea to fatal colitis and occasionally occurring over two months following cessation of antibiotic therapy. Overgrowth of _C. difficile_ resulting from antibiotic use, along with its production of A and B toxins, contributes to morbidity and mortality in these patients. Because of the associated risks, clindamycin should be reserved for serious infections for which the use of less toxic antimicrobial agents are inappropriate.  Clindamycin is active against a number of gram-positive aerobic bacteria, as well as both gram-positive and gram-negative anaerobes. Resistance to clindamycin may develop, and is generally the result of base modification within the 23S ribosomal RNA. Cross-resistance between clindamycin and lincomycin is complete, and may also occur between clindamycin and macrolide antibiotics (e.g. [erythromycin]) due to similarities in their binding sites.  As antimicrobial susceptibility patterns are geographically distinct, local antibiograms should be consulted to ensure adequate coverage of relevant pathogens prior to use.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=446598&t=l",
    "molecular_formula": "C18H33ClN2O5S",
    "molecular_weight": "425.0",
    "smiles": "CCC[C@@H]1C[C@H](N(C1)C)C(=O)N[C@@H]([C@@H]2[C@@H]([C@@H]([C@H]([C@H](O2)SC)O)O)O)[C@H](C)Cl",
    "inchi_key": "KDLRVYVGXIQJDK-AWPVFWJPSA-N"
  },
  {
    "name": "Gentamicin",
    "cid": 3467,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/3467",
    "mechanism": "There are 3 key phases of aminoglycoside entry into cells. The first “ionic binding phase” occurs when polycationic aminoglycosides bind electrostatically to negatively charged components of bacterial cell membranes including with lipopolysaccharides and phospholipids within the outer membrane of Gram-negative bacteria and to teichoic acids and phospholipids within the cell membrane of Gram-positive bacteria. This binding results in displacement of divalent cations and increased membrane permeability, allowing for aminoglycoside entry. The second “energy-dependent phase I” of aminoglycoside entry into the cytoplasm relies on the proton-motive force and allows a limited amount of aminoglycoside access to its primary intracellular target - the bacterial 30S ribosome. This ultimately results in the mistranslation of proteins and disruption of the cytoplasmic membrane. Finally, in the “energy-dependent phase II” stage, concentration-dependent bacterial killing is observed. Aminoglycoside rapidly accumulates in the cell due to the damaged cytoplasmic membrane, and protein mistranslation and synthesis inhibition is amplified. The necessity of oxygen-dependent active transport explains why aminoglycosides are ineffective against anaerobic bacteria. Hence, aminoglycosides have both immediate bactericidal effects through membrane disruption and delayed bactericidal effects through impaired protein synthesis; observed experimental data and mathematical modeling support this two-mechanism model. Inhibition of protein synthesis is a key component of aminoglycoside efficacy. Structural and cell biological studies suggest that aminoglycosides bind to the 16S rRNA in helix 44 (h44), near the A site of the 30S ribosomal subunit, altering interactions between h44 and h45. This binding also displaces two important residues, A1492 and A1493, from h44, mimicking normal conformational changes that occur with successful codon-anticodon pairing in the A site. Overall, aminoglycoside binding has several negative effects including inhibition of translation, initiation, elongation, and ribosome recycling. Recent evidence suggests that the latter effect is due to a cryptic second binding site situated in h69 of the 23S rRNA of the 50S ribosomal subunit. Also, by stabilizing a conformation that mimics correct codon-anticodon pairing, aminoglycosides promote error-prone translation. Mistranslated proteins can incorporate into the cell membrane, inducing the damage discussed above.",
    "pharmacology": "Not found",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Aminoglycosides",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=3467&t=l",
    "molecular_formula": "C21H43N5O7",
    "molecular_weight": "477.6",
    "smiles": "CC(C1CCC(C(O1)OC2C(CC(C(C2O)OC3C(C(C(CO3)(C)O)NC)O)N)N)N)NC",
    "inchi_key": "CEAZRRDELHUEMR-UHFFFAOYSA-N"
  },
  {
    "name": "Metronidazole",
    "cid": 4173,
    "pubchem_url": "https://pubchem.ncbi.nlm.nih.gov/compound/4173",
    "mechanism": "The exact mechanism of action of metronidazole has not been fully established, however, it is possible that an intermediate in the reduction of metronidazole which is only made by anaerobic bacteria and protozoa, binds deoxyribonucleic acid and electron-transport proteins of organisms, blocking nucleic acid synthesis. After administration, metronidazole enters cells by passive diffusion. Following this, ferredoxin or flavodoxin reduce its nitro group to nitro radicals. The redox potential of the electron transport portions of anaerobic or microaerophilic microorganisms renders metronidazole selective to these organisms, which cause nitro group reduction, leading to the production of toxic metabolites. These include N-(2-hydroxyethyl) oxamic acid and acetamide, which may damage DNA of replicating organisms.",
    "pharmacology": "Metronidazole treats amebiasis, trichomoniasis, and giardiasis, exerting both antibacterial and antiprotozoal activities. Metronidazole is an effective treatment for some anaerobic bacterial infections. Metronidazole has shown antibacterial activity against the majority of obligate anaerobes, however, during in vitro studies, it does not demonstrate significant action against facultative anaerobes or obligate aerobes. The nitro group reduction of metronidazole by anaerobic organisms is likely responsible for the drug's antimicrobial cytotoxic effects, causing DNA strand damage to microbes.  A note on convulsions and neuropathy and carcinogenesis  It is important to be aware of the risk of peripheral neuropathy and convulsions associated with metronidazole, especially at higher doses. If convulsions or numbness of an extremity occur, discontinue the drug immediately. Metronidazole has been found to be carcinogenic in mice and rats. The relevance to this effect in humans is unknown. It is advisable to only administer metronidazole when clinically necessary and only for its approved indications.",
    "drug_class": "Breast Feeding; Lactation; Milk, Human; Anti-Infective Agents; Antibacterial Agents; Antiprotozoal Agents; Nitroimidazoles",
    "antibacterial_activity": "Not found",
    "structure_image": "https://pubchem.ncbi.nlm.nih.gov/image/imgsrv.fcgi?cid=4173&t=l",
    "molecular_formula": "C6H9N3O3",
    "molecular_weight": "171.15",
    "smiles": "CC1=NC=C(N1CCO)[N+](=O)[O-]",
    "inchi_key": "VAOCPAMSLUNLGC-UHFFFAOYSA-N"
  }
]